prusa3d/Prusa-Firmware-Buddy/lib/CycloneTCP/drivers/mac/efm32gg11_eth_driver.c
/**
 * @file efm32gg11_eth_driver.c
 * @brief EFM32 Giant Gecko 11 Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2021 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.0.4
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include <limits.h>
#include "em_device.h"
#include "em_cmu.h"
#include "em_gpio.h"
#include "core/net.h"
#include "drivers/mac/efm32gg11_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//IAR EWARM compiler?
#if defined(__ICCARM__)

//TX buffer
#pragma data_alignment = 8
static uint8_t txBuffer[EFM32GG11_ETH_TX_BUFFER_COUNT][EFM32GG11_ETH_TX_BUFFER_SIZE];
//RX buffer
#pragma data_alignment = 8
static uint8_t rxBuffer[EFM32GG11_ETH_RX_BUFFER_COUNT][EFM32GG11_ETH_RX_BUFFER_SIZE];
//TX buffer descriptors
#pragma data_alignment = 4
static Efm32gg11TxBufferDesc txBufferDesc[EFM32GG11_ETH_TX_BUFFER_COUNT];
//RX buffer descriptors
#pragma data_alignment = 4
static Efm32gg11RxBufferDesc rxBufferDesc[EFM32GG11_ETH_RX_BUFFER_COUNT];

//Keil MDK-ARM or GCC compiler?
#else

//TX buffer
static uint8_t txBuffer[EFM32GG11_ETH_TX_BUFFER_COUNT][EFM32GG11_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(8)));
//RX buffer
static uint8_t rxBuffer[EFM32GG11_ETH_RX_BUFFER_COUNT][EFM32GG11_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(8)));
//TX buffer descriptors
static Efm32gg11TxBufferDesc txBufferDesc[EFM32GG11_ETH_TX_BUFFER_COUNT]
   __attribute__((aligned(4)));
//RX buffer descriptors
static Efm32gg11RxBufferDesc rxBufferDesc[EFM32GG11_ETH_RX_BUFFER_COUNT]
   __attribute__((aligned(4)));

#endif

//TX buffer index
static uint_t txBufferIndex;
//RX buffer index
static uint_t rxBufferIndex;


/**
 * @brief EFM32GG11 Ethernet MAC driver
 **/

const NicDriver efm32gg11EthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   efm32gg11EthInit,
   efm32gg11EthTick,
   efm32gg11EthEnableIrq,
   efm32gg11EthDisableIrq,
   efm32gg11EthEventHandler,
   efm32gg11EthSendPacket,
   efm32gg11EthUpdateMacAddrFilter,
   efm32gg11EthUpdateMacConfig,
   efm32gg11EthWritePhyReg,
   efm32gg11EthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief EFM32GG11 Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t efm32gg11EthInit(NetInterface *interface)
{
   error_t error;
   volatile uint32_t status;

   //Debug message
   TRACE_INFO("Initializing EFM32GG11 Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //Enable high-frequency peripheral clock
   CMU_ClockEnable(cmuClock_HFPER, true);
   //Enable Ethernet peripheral clock
   CMU_ClockEnable(cmuClock_ETH, true);

   //Disable transmit and receive circuits
   ETH->NETWORKCTRL = 0;

   //GPIO configuration
   efm32gg11EthInitGpio(interface);

   //Configure MDC clock speed
   ETH->NETWORKCFG = (4 << _ETH_NETWORKCFG_MDCCLKDIV_SHIFT) &
      _ETH_NETWORKCFG_MDCCLKDIV_MASK;

   //Enable management port (MDC and MDIO)
   ETH->NETWORKCTRL |= _ETH_NETWORKCTRL_MANPORTEN_MASK;

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Set the MAC address of the station
   ETH->SPECADDR1BOTTOM = interface->macAddr.w[0] | (interface->macAddr.w[1] << 16);
   ETH->SPECADDR1TOP = interface->macAddr.w[2];

   //The MAC supports 3 additional addresses for unicast perfect filtering
   ETH->SPECADDR2BOTTOM = 0;
   ETH->SPECADDR3BOTTOM = 0;
   ETH->SPECADDR4BOTTOM = 0;

   //Initialize hash table
   ETH->HASHBOTTOM = 0;
   ETH->HASHTOP = 0;

   //Configure the receive filter
   ETH->NETWORKCFG |= _ETH_NETWORKCFG_RX1536BYTEFRAMES_MASK |
      _ETH_NETWORKCFG_MULTICASTHASHEN_MASK;

   //Initialize buffer descriptors
   efm32gg11EthInitBufferDesc(interface);

   //Clear transmit status register
   ETH->TXSTATUS = _ETH_TXSTATUS_TXUNDERRUN_MASK |
      _ETH_TXSTATUS_TXCMPLT_MASK | _ETH_TXSTATUS_AMBAERR_MASK |
      _ETH_TXSTATUS_TXGO_MASK | _ETH_TXSTATUS_RETRYLMTEXCD_MASK |
      _ETH_TXSTATUS_COLOCCRD_MASK | _ETH_TXSTATUS_USEDBITREAD_MASK;

   //Clear receive status register
   ETH->RXSTATUS = _ETH_RXSTATUS_RXOVERRUN_MASK | _ETH_RXSTATUS_FRMRX_MASK |
      _ETH_RXSTATUS_BUFFNOTAVAIL_MASK;

   //First disable all interrupts
   ETH->IENC = 0xFFFFFFFF;

   //Only the desired ones are enabled
   ETH->IENS = _ETH_IENS_RXOVERRUN_MASK |
      _ETH_IENS_TXCMPLT_MASK | _ETH_IENS_AMBAERR_MASK |
      _ETH_IENS_RTRYLMTORLATECOL_MASK | _ETH_IENS_TXUNDERRUN_MASK |
      _ETH_IENS_RXUSEDBITREAD_MASK | _ETH_IENS_RXCMPLT_MASK;

   //Read ETH_IFCR register to clear any pending interrupt
   status = ETH->IFCR;

   //Set priority grouping (3 bits for pre-emption priority, no bits for subpriority)
   NVIC_SetPriorityGrouping(EFM32GG11_ETH_IRQ_PRIORITY_GROUPING);

