prusa3d/Prusa-Firmware-Buddy/lib/CycloneTCP/drivers/mac/efm32gg11_eth_driver.c
   //Configure Ethernet interrupt priority
   NVIC_SetPriority(ETH_IRQn, NVIC_EncodePriority(EFM32GG11_ETH_IRQ_PRIORITY_GROUPING,
      EFM32GG11_ETH_IRQ_GROUP_PRIORITY, EFM32GG11_ETH_IRQ_SUB_PRIORITY));

   //Enable the transmitter and the receiver
   ETH->NETWORKCTRL |= _ETH_NETWORKCTRL_ENBTX_MASK | _ETH_NETWORKCTRL_ENBRX_MASK;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


//EFM32 Giant Gecko 11 Starter Kit?
#if defined(USE_EFM32_GIANT_GECKO_11_SK)

/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

void efm32gg11EthInitGpio(NetInterface *interface)
{
   uint32_t temp;

   //Enable GPIO clock
   CMU_ClockEnable(cmuClock_GPIO, true);
   //Enable external oscillator
   CMU_OscillatorEnable(cmuOsc_HFXO, true, true);

   //Select CMU_CLK2 clock source
   CMU->CTRL |= CMU_CTRL_CLKOUTSEL2_HFXO;

   //Configure CMU_CLK2 (PD10)
   GPIO_PinModeSet((GPIO_Port_TypeDef) AF_CMU_CLK2_PORT(5),
      AF_CMU_CLK2_PIN(5), gpioModePushPull, 0);

   //Remap CMU_CLK2 pin
   temp = CMU->ROUTELOC0 & ~_CMU_ROUTELOC0_CLKOUT2LOC_MASK;
   CMU->ROUTELOC0 = temp | CMU_ROUTELOC0_CLKOUT2LOC_LOC5;

   //Enable CMU_CLK2 pin
   CMU->ROUTEPEN |= CMU_ROUTEPEN_CLKOUT2PEN;

   //Select RMII operation mode and enable transceiver clock
   ETH->CTRL = ETH_CTRL_GBLCLKEN | ETH_CTRL_MIISEL_RMII;

   //Configure ETH_RMII_TXD0 (PF7)
   GPIO_PinModeSet((GPIO_Port_TypeDef) AF_ETH_RMIITXD0_PORT(1),
      AF_ETH_RMIITXD0_PIN(1), gpioModePushPull, 0);

   //Configure ETH_RMII_TXD1 (PF6)
   GPIO_PinModeSet((GPIO_Port_TypeDef) AF_ETH_RMIITXD1_PORT(1),
      AF_ETH_RMIITXD1_PIN(1), gpioModePushPull, 0);

   //Configure ETH_RMII_TXEN (PF8)
   GPIO_PinModeSet((GPIO_Port_TypeDef) AF_ETH_RMIITXEN_PORT(1),
      AF_ETH_RMIITXEN_PIN(1), gpioModePushPull, 0);

   //Configure ETH_RMII_RXD0 (PD9)
   GPIO_PinModeSet((GPIO_Port_TypeDef) AF_ETH_RMIIRXD0_PORT(1),
      AF_ETH_RMIIRXD0_PIN(1), gpioModeInput, 0);

   //Configure ETH_RMII_RXD1 (PF9)
   GPIO_PinModeSet((GPIO_Port_TypeDef) AF_ETH_RMIIRXD1_PORT(1),
      AF_ETH_RMIIRXD1_PIN(1), gpioModeInput, 0);

   //Configure ETH_RMII_CRSDV (PD11)
   GPIO_PinModeSet((GPIO_Port_TypeDef) AF_ETH_RMIICRSDV_PORT(1),
      AF_ETH_RMIICRSDV_PIN(1), gpioModeInput, 0);

   //Configure ETH_RMII_RXER (PD12)
   GPIO_PinModeSet((GPIO_Port_TypeDef) AF_ETH_RMIIRXER_PORT(1),
      AF_ETH_RMIIRXER_PIN(1), gpioModeInput, 0);

   //Configure ETH_MDIO (PD13)
   GPIO_PinModeSet((GPIO_Port_TypeDef) AF_ETH_MDIO_PORT(1),
      AF_ETH_MDIO_PIN(1), gpioModePushPull, 0);

   //Configure ETH_MDC (PD14)
   GPIO_PinModeSet((GPIO_Port_TypeDef) AF_ETH_MDC_PORT(1),
      AF_ETH_MDC_PIN(1), gpioModePushPull, 0);

   //Remap RMII pins
   temp = ETH->ROUTELOC1 & ~(_ETH_ROUTELOC1_RMIILOC_MASK & _ETH_ROUTELOC1_MDIOLOC_MASK);
   ETH->ROUTELOC1 = temp | (ETH_ROUTELOC1_RMIILOC_LOC1 | ETH_ROUTELOC1_MDIOLOC_LOC1);

   //Enable RMII pins
   ETH->ROUTEPEN  = ETH_ROUTEPEN_RMIIPEN | ETH_ROUTEPEN_MDIOPEN;

   //Configure ETH_PWR_ENABLE (PI10)
   GPIO_PinModeSet(gpioPortI, 10, gpioModePushPull, 0);
   //Configure ETH_RESET_N (PH7)
   GPIO_PinModeSet(gpioPortH, 7, gpioModePushPull, 0);
   //Configure ETH_INTRP (PG15)
   GPIO_PinModeSet(gpioPortG, 15, gpioModeInput, 0);

   //Power on PHY transceiver
   GPIO_PinOutSet(gpioPortI, 10);
   sleep(10);

   //Reset PHY transceiver (hard reset)
   GPIO_PinOutClear(gpioPortH, 7);
   sleep(10);
   GPIO_PinOutSet(gpioPortH, 7);
   sleep(10);
}

#endif


/**
 * @brief Initialize buffer descriptors
 * @param[in] interface Underlying network interface
 **/

void efm32gg11EthInitBufferDesc(NetInterface *interface)
{
   uint_t i;
   uint32_t address;

   //Initialize TX buffer descriptors
   for(i = 0; i < EFM32GG11_ETH_TX_BUFFER_COUNT; i++)
   {
      //Calculate the address of the current TX buffer
      address = (uint32_t) txBuffer[i];
      //Write the address to the descriptor entry
      txBufferDesc[i].address = address;
      //Initialize status field
      txBufferDesc[i].status = ETH_TX_USED;
   }

   //Mark the last descriptor entry with the wrap flag
   txBufferDesc[i - 1].status |= ETH_TX_WRAP;
   //Initialize TX buffer index
   txBufferIndex = 0;

   //Initialize RX buffer descriptors
   for(i = 0; i < EFM32GG11_ETH_RX_BUFFER_COUNT; i++)
   {
      //Calculate the address of the current RX buffer
      address = (uint32_t) rxBuffer[i];
      //Write the address to the descriptor entry
      rxBufferDesc[i].address = address & ETH_RX_ADDRESS;
      //Clear status field
      rxBufferDesc[i].status = 0;
   }

   //Mark the last descriptor entry with the wrap flag
   rxBufferDesc[i - 1].address |= ETH_RX_WRAP;
   //Initialize RX buffer index
   rxBufferIndex = 0;

   //Start location of the TX descriptor list
   ETH->TXQPTR = (uint32_t) txBufferDesc;
   //Start location of the RX descriptor list
   ETH->RXQPTR = (uint32_t) rxBufferDesc;
}


/**
 * @brief EFM32GG11 Ethernet MAC timer handler
 *
 * This routine is periodically called by the TCP/IP stack to handle periodic
 * operations such as polling the link state
 *
 * @param[in] interface Underlying network interface
 **/

void efm32gg11EthTick(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Handle periodic operations
      interface->phyDriver->tick(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Handle periodic operations
      interface->switchDriver->tick(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Enable interrupts
 * @param[in] interface Underlying network interface
 **/

void efm32gg11EthEnableIrq(NetInterface *interface)
{
   //Enable Ethernet MAC interrupts
   NVIC_EnableIRQ(ETH_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Enable Ethernet PHY interrupts
      interface->phyDriver->enableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Enable Ethernet switch interrupts
      interface->switchDriver->enableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Disable interrupts
 * @param[in] interface Underlying network interface
 **/

void efm32gg11EthDisableIrq(NetInterface *interface)
{
   //Disable Ethernet MAC interrupts
   NVIC_DisableIRQ(ETH_IRQn);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Disable Ethernet PHY interrupts
      interface->phyDriver->disableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Disable Ethernet switch interrupts
      interface->switchDriver->disableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief EFM32GG11 Ethernet MAC interrupt service routine
 **/

void ETH_IRQHandler(void)
{
   bool_t flag;
   volatile uint32_t isr;
   volatile uint32_t tsr;
   volatile uint32_t rsr;

   //Interrupt service routine prologue
   osEnterIsr();

   //This flag will be set if a higher priority task must be woken
   flag = FALSE;

   //Each time the software reads ETH_IFCR, it has to check the contents
   //of ETH_TXSTATUS, ETH_RXSTATUS and ETH_NETWORKSTATUS
   isr = ETH->IFCR;
   tsr = ETH->TXSTATUS;
   rsr = ETH->RXSTATUS;

   //Clear interrupt flags
   ETH->IFCR = isr;

   //Packet transmitted?
   if((tsr & (_ETH_TXSTATUS_TXUNDERRUN_MASK | _ETH_TXSTATUS_TXCMPLT_MASK |
      _ETH_TXSTATUS_AMBAERR_MASK | _ETH_TXSTATUS_TXGO_MASK |
      _ETH_TXSTATUS_RETRYLMTEXCD_MASK | _ETH_TXSTATUS_COLOCCRD_MASK |
      _ETH_TXSTATUS_USEDBITREAD_MASK)) != 0)
   {
      //Only clear TXSTATUS flags that are currently set
      ETH->TXSTATUS = tsr;

